recept/src/Catalogs/НоменклатураМатериалы/НоменклатураМатериалы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НоменклатураМатериалы</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Архив</name>
      <description>Архив</description>
    </items>
    <items>
      <name>Продукция</name>
      <description>Продукция</description>
    </items>
    <items>
      <name>Сырье</name>
      <description>Сырье</description>
    </items>
  </predefined>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияСырья</name>
    <type>
      <types>EnumRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальныйОстаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>CatalogRef.Цвет</types>
    </type>
  </attributes>
  <attributes>
    <name>RAL</name>
    <type>
      <types>CatalogRef.RAL</types>
    </type>
  </attributes>
  <attributes>
    <name>Фасовка</name>
    <type>
      <types>CatalogRef.Фасовка</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестоХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Вязкость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Перетир</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

recept/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Продукция</name>
  </enumValues>
  <enumValues>
    <name>Сырье</name>
  </enumValues>
  <enumValues>
    <name>УслугаРазделитель</name>
  </enumValues>
</mdclass:Enum>

recept/src/Enums/ЕдиницыИзмерения/ЕдиницыИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЕдиницыИзмерения</name>
  <enumValues>
    <name>Литр</name>
  </enumValues>
  <enumValues>
    <name>Килограмм</name>
  </enumValues>
  <enumValues>
    <name>Штука</name>
  </enumValues>
  <enumValues>
    <name>услуга</name>
  </enumValues>
</mdclass:Enum>

recept/src/Catalogs/НоменклатураМатериалы/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ТипНоменклатурыПриИзменении(Элемент)
	Если Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Сырье") Тогда 
		Элементы.МинимальныйОстаток.Видимость = Истина;
		Элементы.Фасовка.Видимость = Ложь;
		Элементы.Цвет.Видимость = Ложь;
		Элементы.RAL.Видимость = Ложь;
		Элементы.Номенклатура.Видимость = Ложь;   
		Элементы.МестоХранения.Видимость = Истина;
		Элементы.Вязкость.Видимость = Ложь;
		Элементы.Перетир.Видимость = Ложь;
		Объект.ЕдиницаИзмеренияСырья = ПредопределенноеЗначение("Перечисление.ЕдиницыИзмерения.Килограмм");
		Объект.Родитель =  ПредопределенноеЗначение("Справочник.НоменклатураМатериалы.Сырье");
				
	ИначеЕсли Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Продукция") Тогда
		Элементы.МинимальныйОстаток.Видимость = Ложь;
		Элементы.Цвет.Видимость = Истина;
		Элементы.RAL.Видимость = Истина;  
		Элементы.Номенклатура.Видимость = Истина;
		Элементы.МестоХранения.Видимость = Истина;
		Элементы.Вязкость.Видимость = Истина;
		Элементы.Перетир.Видимость = Истина;
		Объект.ЕдиницаИзмеренияСырья = ПредопределенноеЗначение("Перечисление.ЕдиницыИзмерения.Килограмм");
		Объект.Родитель =  ПредопределенноеЗначение("Справочник.НоменклатураМатериалы.Продукция");
		
	ИначеЕсли Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.УслугаРазделитель") Тогда
		Элементы.МинимальныйОстаток.Видимость = Ложь; 
		Элементы.Фасовка.Видимость = Ложь;
		Элементы.Цвет.Видимость = Ложь;
		Элементы.RAL.Видимость = Ложь; 
		Элементы.Номенклатура.Видимость = Ложь; 
		Элементы.МестоХранения.Видимость = Ложь;
		Элементы.Вязкость.Видимость = Ложь;
		Элементы.Перетир.Видимость = Ложь;
		Объект.ЕдиницаИзмеренияСырья = ПредопределенноеЗначение("Перечисление.ЕдиницыИзмерения.услуга"); 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Цвет) И ЗначениеЗаполнено(Объект.RAL) Тогда
		Объект.Наименование = Строка(Объект.Номенклатура) + " " + Строка(Объект.Цвет) + " RAL " + Строка(Объект.RAL) + " (" + Строка(Объект.Фасовка) + ")";
	ИначеЕсли ЗначениеЗаполнено(Объект.Цвет) И НЕ ЗначениеЗаполнено(Объект.RAL) Тогда
		Объект.Наименование = Строка(Объект.Номенклатура) + " " + Строка(Объект.Цвет) + " (" + Строка(Объект.Фасовка) + ") ";
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Цвет) И НЕ ЗначениеЗаполнено(Объект.RAL) Тогда
		Объект.Наименование = Строка(Объект.Номенклатура) + " (" + Строка(Объект.Фасовка) + ") ";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФасовкаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Цвет) И ЗначениеЗаполнено(Объект.RAL) Тогда
		Объект.Наименование = Строка(Объект.Номенклатура) + " " + Строка(Объект.Цвет) + " RAL " + Строка(Объект.RAL) + " (" + Строка(Объект.Фасовка) + ")";
	ИначеЕсли ЗначениеЗаполнено(Объект.Цвет) И НЕ ЗначениеЗаполнено(Объект.RAL) Тогда
		Объект.Наименование = Строка(Объект.Номенклатура) + " " + Строка(Объект.Цвет) + " (" + Строка(Объект.Фасовка) + ") ";
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Цвет) И НЕ ЗначениеЗаполнено(Объект.RAL) Тогда
		Объект.Наименование = Строка(Объект.Номенклатура) + " (" + Строка(Объект.Фасовка) + ") ";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЦветПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Цвет) И ЗначениеЗаполнено(Объект.RAL) Тогда
		Объект.Наименование = Строка(Объект.Номенклатура) + " " + Строка(Объект.Цвет) + " RAL " + Строка(Объект.RAL) + " (" + Строка(Объект.Фасовка) + ")";
	ИначеЕсли ЗначениеЗаполнено(Объект.Цвет) И НЕ ЗначениеЗаполнено(Объект.RAL) Тогда
		Объект.Наименование = Строка(Объект.Номенклатура) + " " + Строка(Объект.Цвет) + " (" + Строка(Объект.Фасовка) + ") ";
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Цвет) И НЕ ЗначениеЗаполнено(Объект.RAL) Тогда
		Объект.Наименование = Строка(Объект.Номенклатура) + " (" + Строка(Объект.Фасовка) + ") ";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура RALПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Цвет) И ЗначениеЗаполнено(Объект.RAL) Тогда
		Объект.Наименование = Строка(Объект.Номенклатура) + " " + Строка(Объект.Цвет) + " RAL " + Строка(Объект.RAL) + " (" + Строка(Объект.Фасовка) + ")";
	ИначеЕсли ЗначениеЗаполнено(Объект.Цвет) И НЕ ЗначениеЗаполнено(Объект.RAL) Тогда
		Объект.Наименование = Строка(Объект.Номенклатура) + " " + Строка(Объект.Цвет) + " (" + Строка(Объект.Фасовка) + ") ";
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Цвет) И НЕ ЗначениеЗаполнено(Объект.RAL) Тогда
		Объект.Наименование = Строка(Объект.Номенклатура) + " (" + Строка(Объект.Фасовка) + ") ";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Сырье") Тогда 
		Элементы.МинимальныйОстаток.Видимость = Истина;
		Элементы.Фасовка.Видимость = Ложь;
		Элементы.Цвет.Видимость = Ложь;
		Элементы.RAL.Видимость = Ложь;
		Элементы.Номенклатура.Видимость = Ложь;   
		Элементы.МестоХранения.Видимость = Истина;
		Элементы.Вязкость.Видимость = Ложь;
		Элементы.Перетир.Видимость = Ложь;
		Объект.ЕдиницаИзмеренияСырья = ПредопределенноеЗначение("Перечисление.ЕдиницыИзмерения.Килограмм");
				
	ИначеЕсли Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Продукция") Тогда
		Элементы.МинимальныйОстаток.Видимость = Ложь;
		Элементы.Цвет.Видимость = Истина;
		Элементы.RAL.Видимость = Истина;  
		Элементы.Номенклатура.Видимость = Истина;
		Элементы.МестоХранения.Видимость = Истина;
		Элементы.Вязкость.Видимость = Истина;
		Элементы.Перетир.Видимость = Истина; 
		Объект.Родитель = ПредопределенноеЗначение("Справочник.НоменклатураМатериалы.Продукция"); 
		Объект.ЕдиницаИзмеренияСырья = ПредопределенноеЗначение("Перечисление.ЕдиницыИзмерения.Килограмм");
		
	ИначеЕсли Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.УслугаРазделитель") Тогда
		Элементы.МинимальныйОстаток.Видимость = Ложь; 
		Элементы.Фасовка.Видимость = Ложь;
		Элементы.Цвет.Видимость = Ложь;
		Элементы.RAL.Видимость = Ложь; 
		Элементы.Номенклатура.Видимость = Ложь; 
		Элементы.МестоХранения.Видимость = Ложь;
		Элементы.Вязкость.Видимость = Ложь;
		Элементы.Перетир.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Не ЗначениеЗаполнено(Объект.Родитель) Тогда
		Сообщить("Не заполнена группа номенклатуры!");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
